# Task 4.9 Intro to Data Visualisation with Python

## Step 1-3 importing libraries and 'customers.csv' file

In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
path = r'C:\Users\RUZANNA\OneDrive\Desktop\Careerfoundry\Python\Instacart Basket Anlysis-05.2023'

In [4]:
custom = pd.read_csv (os.path.join(path, '02_Data', 'Original Data', 'customers', 'customers.csv'))

In [5]:
ords_prods_merge =pd.read_pickle(os.path.join(path, '02_Data','Prepared Data','orders_products_merged_4.8.pkl'))

In [6]:
ords_prods_merge.shape

(32404859, 23)

## Step 4 Data Wrangling

In [7]:
custom.shape

(206209, 10)

In [8]:
custom.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
customs= custom.rename(columns= {'First Name':'first_name','Surnam':'last_name', 'STATE': 'state', 'Age': 'age','date_joined':'date_of_joined', 'n_dependants': 'number_of_dependents', 'fam_status': 'family_status', 'income':'income'})

In [10]:
customs.head(2)

,user_id,first_name,last_name,Gender,state,age,date_of_joined,number_of_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285

According to the questions in task almost all columns are important, so there is no need to remove any of them

## Step 5 - Consistency checking

In [11]:
customs.describe()

             user_id            age  number_of_dependents         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [12]:
customs['user_id'] = customs['user_id'].astype('str')

In [13]:
customs.describe()

                 age  number_of_dependents         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

## Finding Mixed-Type Data

In [14]:
for col in customs.columns.tolist():
  weird = (customs[[col]].applymap(type) != customs[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customs[weird]) > 0:
    print (col)

first_name

First Name is a mixed-type data , we can use astype function to turn into string

In [15]:
customs['first_name'] = customs['first_name'].astype('str')

In [16]:
for col in customs.columns.tolist():
  weird = (customs[[col]].applymap(type) != customs[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customs[weird]) > 0:
    print (col)

## Finding Missing values

In [17]:
customs.isnull().sum()

user_id                 0
first_name              0
last_name               0
Gender                  0
state                   0
age                     0
date_of_joined          0
number_of_dependents    0
family_status           0
income                  0
dtype: int64

No missing value found

## Finding Duplicates

In [18]:
customs[customs.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, Gender, state, age, date_of_joined, number_of_dependents, family_status, income]
Index: []

No duplicates found

In [19]:
customs.shape

(206209, 10)

## Data cleaning for ords_prods_merge

In [20]:
ords_prods_merge.head(2)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,Busiest days,Slowest days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_order,Frequency_flag
0,2398795,1.0,2.0,3.0,7.0,15.0,196.0,1.0,1.0,Soda,...,Mid range product,Non busiest days,Slowest days,Fewest order,10.0,New customer,6.372222,Low spender,20.5,Non-frequent customer
1,473747,1.0,3.0,3.0,12.0,21.0,196.0,1.0,1.0,Soda,...,Mid range product,Non busiest days,Slowest days,Average orders,10.0,New customer,6.372222,Low spender,20.5,Non-frequent customer

In [21]:
ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'department_id',
       'prices', 'busiest_day', 'price_range_loc', 'Busiest days',
       'Slowest days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'average_price', 'spending_flag', 'median_order', 'Frequency_flag'],
      dtype='object')

In [22]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 float64
 2   order_number            float64
 3   orders_day_of_week      float64
 4   order_hour_of_day       float64
 5   days_since_prior_order  float16
 6   product_id              float64
 7   add_to_cart_order       float64
 8   reordered               float64
 9   product_name            object
 10  department_id           int64
 11  prices                  float64
 12  busiest_day             object
 13  price_range_loc         object
 14  Busiest days            object
 15  Slowest days            object
 16  busiest_period_of_day   object
 17  max_order               float64
 18  loyalty_flag            object
 19  average_price           float64
 20  spending_flag           object
 21  median_order            float16
 22  Frequency_flag          object
dtypes: float16(2), float64(10), int32(1), int64(1), object(9)
memory usage: 5.3+ GB

In [23]:
ords_prods_merge['order_id'] =ords_prods_merge['order_id'].astype('float64')

In [24]:
ords_prods_merge['department_id'] =ords_prods_merge['department_id'].astype('float64')

In [25]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                float64
 1   user_id                 float64
 2   order_number            float64
 3   orders_day_of_week      float64
 4   order_hour_of_day       float64
 5   days_since_prior_order  float16
 6   product_id              float64
 7   add_to_cart_order       float64
 8   reordered               float64
 9   product_name            object
 10  department_id           float64
 11  prices                  float64
 12  busiest_day             object
 13  price_range_loc         object
 14  Busiest days            object
 15  Slowest days            object
 16  busiest_period_of_day   object
 17  max_order               float64
 18  loyalty_flag            object
 19  average_price           float64
 20  spending_flag           object
 21  median_order            float16
 22  Frequency_flag          object
dtypes: float16(2), float64(12), object(9)
memory usage: 5.4+ GB

In [26]:
ords_prods_merge.loc[ords_prods_merge['prices']>100, 'prices'] = np.nan

## Step 6

In [27]:
# Before combining the two dataframe I check the type of key column- 'user_id'.
customs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  object
 1   first_name            206209 non-null  object
 2   last_name             206209 non-null  object
 3   Gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_of_joined        206209 non-null  object
 7   number_of_dependents  206209 non-null  int64
 8   family_status         206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(3), object(7)
memory usage: 15.7+ MB

In [28]:
# I changed the type to make them same
customs['user_id'] =customs['user_id'].astype('float64')

In [29]:
# Droping first_name and last_name columns to maintain privacy as it is required by lesson 4.10
customs.drop(columns = {'first_name', 'last_name'}, inplace = True)

In [30]:
custom.to_pickle(os.path.join(path,'02_Data', 'Prepared Data', 'custom_2.pkl'  ))

In [ ]:
ords_prods_custom_merge = ords_prods_merge.merge(customs, on = 'user_id')

## Step 7, 8

In [31]:
ords_prods_custom_merge.to_pickle(os.path.join(path,'02_Data', 'Prepared Data', 'ords_prods_custom_merge.pkl'  ))